# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
  [-1, 4, DialtedC3, [512, True]],
   [-1, 3, C3TR, [512]] # 8
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [256, 1, 1]],                #9 cat head 40x40
   [-1, 3, DialtedC3, [256, False]],          #10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 80x80
   [[-1, 4], 1, Concat, [1]],                 # cat backbone 3c3
   [-1, 3, DialtedC3, [256, False]],          #13 detect 1

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],                 # cat neck 80
   [-1, 3, DialtedC3, [256, False]],           #16 detect 2   80x80x256

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 9], 1, Concat, [1]],                    # cat neck 40x40
   [-1, 3, DialtedC3, [256, False]],             #19 detect 3  40x40x512

   [[13,16,19], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
