# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:   # AutoAnchor evolves 3 anchors per P output layer 5,6, 7,7, 8,9, 10,11, 13,13, 16,16, 19,20, 16,34, 25,25, 32,32, 39,44, 60,57
  - [5,6, 7,7, 8,9]         # 4
  - [ 10,11, 13,13, 16,16 ]  # P3/8
  - [ 19,20, 16,34, 25,25 ]  # P4/16
  - [ 32,32, 39,44, 60,57 ]  # P5/32
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [[-1,2], 6, ModifyC3DeformConvV2, [256,True,128]],   # add with detect 80x80x128  参数含义[256,True,] out_channel,skip_connection,previous channel
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [[-1,4], 9, ModifyC3DeformConvV2, [512,True,256]],    # add with detect 40x40x128
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [[-1,6], 3, ModifyC3TR, [1024,True,512]],   # add with detect 20x20x128
   [-1, 1, ShuffleAttention, [1024]],  # ShuffleAttention
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [[-1,2], 1, ModifyC3Head, [128, False,128]],  # 21 (P2/4-xsmall)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P3
   [[-1,4], 3, ModifyC3Head, [256, False,256]],  # 24 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [[-1, 6], 3, ModifyC3Head, [512, False,256]],  # 27 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [[-1, 9], 3, ModifyC3Head, [1024, False,1024]],  # 30 (P5/32-large)     # 可选择与sppf或者C3 add

   [[22, 25, 28, 31], 1, Decoupled_Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
